src/DataProcessors/DocumentPosting.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<DataProcessor>
		<Properties>
			<Name>DocumentPosting</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DocumentsList</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SelectedDocuments</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Posted</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/DocumentPosting/Ext/ObjectModule.bsl
//Filling the documents kinds list
Procedure FillList() Export
	// Creating a list of documents
	For Each MetadataDocument In Metadata.Documents Do
		
		If MetadataDocument.Posting = Metadata.ObjectProperties.Posting.Allow Then
			DocumentsList.Add(MetadataDocument.Name, MetadataDocument.Presentation());
		EndIf;	
		
	EndDo;	
	DocumentsList.SortByPresentation();
	
	Posted = "Posted";
	
EndProcedure	

//Posting documents from the existing list
Procedure Post(StartDate, EndDate, CurrentPostedCount) Export
	
	For Each ListDocument In SelectedDocuments Do
		
		Selection = Documents[ListDocument.Value].Select(StartDate, EndDate);
		
		While Selection.Next() Do
			
			If Posted = "Posted" And Not Selection.Posted Then
				Continue;
			EndIf;
			
			If Posted = "NotPosted" And Selection.Posted Then
				Continue;
			EndIf;
			
			Object = Selection.GetObject();
			Object.Write(DocumentWriteMode.Posting);
			CurrentPostedCount = CurrentPostedCount + 1;
		EndDo;	
		
	EndDo;	
	
EndProcedure
